# Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет


day = int(input('Введите цифру, соответствующую дню недели '))
if day == 6 or day == 7:
    print('Выходной день')
elif 0 < day < 6:
    print('Будний день')
else:
    print('Неверное число')

# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

x = 1
y = 0
z = 0
print((not (x or y or z)) == (not x) and (not y) and (not z))

# Напишите программу, которая принимает на вход
# координаты точки (X и Y),причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3
x = int(input('Введите координату X, причем X ≠ 0 '))
y = int(input('Введите координату Y, причем Y ≠ 0 '))
if x > 0 and y > 0:
    a = 1
elif x < 0 < y:
    a = 2
elif x < 0 and y < 0:
    a = 3
else:
    a = 4
print(f'Точка на координатной плоскости соответствует четверти {a}')

# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

quarter = int(input('Введите номер четверти '))
if quarter == 1:
    print('x > 0, y > 0')
elif quarter == 2:
    print('x < 0, y > 0')
elif quarter == 3:
    print('x < 0, y < 0')
elif quarter == 4:
    print('x > 0, y < 0')
else:
    print('Введен неверный номер четверти')

# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

a1 = int(input('Введите координату х точки А '))
b1 = int(input('Введите координату у точки А '))
a2 = int(input('Введите координату х точки В '))
b2 = int(input('Введите координату у точки В '))
s = ((a2-a1) ** 2 + (b2 - b1) ** 2) ** 0.5
print(f'Расстояние между точкой А и В: {s}')
